# CannotPasteInViewError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteInViewError Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot paste the contents into %1!s! view. Attempt to paste into an appropriate view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteInViewError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteInViewError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteInViewError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace